Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum
Issue type.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.CrossSectionValues
Cross section values issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.ShortRigidLink
Short rigid link issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.ShortMember
Short member issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.ProfileOverride
Part profile override issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.NearNodes
Near nodes issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.RequiredRigidLinkDisabled
Required rigid link disabled issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.TooCloseNodesForRigidLink
Too close nodes for rigid link issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.MemberDirectionDifference
Member direction difference issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.BarDirectionDifference
Bar direction difference issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.BarNotConnected
Bar not connected issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.BarOverlapping
Bar overlapping issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.AreaNotConnected
Area not connected issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.AreaNotPlanar
Area not planar issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.LoadDistribution
Load distribution issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.DuplicateLoad
Duplicate load issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.LoadGroupNotInCombinations
Load group not in load combinations issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.KmodeMustNePhysicalMember
Buckling kmode issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.DesignParameterValueCount
Design parameter value count issue.

Tekla.Structures.Analysis.AnalysisModelIssue.TypeEnum.DesignParameterValue
Design parameter value issue.